Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: سرابيلهم من قطران وتغشى وجوههم النار
en: Their garments of liquid pitch and their faces covered by the Fire.

source: ليجزي الله كل نفس ما كسبت إن الله سريع الحساب
en: So that Allah will recompense every soul for what it earned. Indeed, Allah is swift in account.

source: هذا بلاغ للناس ولينذروا به وليعلموا أنما هو إله واحد وليذكر أولو الألباب
en: This [Qur'an] is notification for the people that they may be warned thereby and that they may know that He is but one God and that those of understanding will be reminded.

source: الر تلك آيات الكتاب وقرآن مبين
en: Alif, Lam, Ra. These are the verses of the Book and a clear Qur'an.

source: ربما يود الذين كفروا لو كانوا مسلمين
en: Perhaps those who disbelieve will wish that they had been Muslims.

source: ذرهم يأكلوا ويتمتعوا ويلههم الأمل فسوف يعلمون
en: Let them eat and enjoy themselves and be diverted by [false] hope, for they are going to know.

source: وما أهلكنا من قرية إلا ولها كتاب معلوم
en: And We did not destroy any city but that for it was a known decree.

source: ما تسبق من أمة أجلها وما يستأخرون
en: No nation will precede its term, nor will they remain thereafter.

source: وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون
en: And they say, "O you upon whom the message has been sent down, indeed you are mad.

source: لو ما تأتينا بالملائكة إن كنت من الصادقين
en: Why do you not bring us the angels, if you should be among the truthful?"

source: ما ننزل الملائكة إلا بالحق وما كانوا إذا منظرين
en: We do not send down the angels except with truth; and the disbelievers would not then be reprieved.

source: إنا نحن نزلنا الذكر وإنا له لحافظون
en: Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian.

source: ولقد أرسلنا من قبلك في شيع الأولين
en: And We had certainly sent [messengers] before you, [O Muhammad], among the sects of the former peoples.

source: وما يأتيهم من رسول إلا كانوا به يستهزئون
en: And no messenger would come to them except that they ridiculed him.

source: كذلك نسلكه في قلوب المجرمين
en: Thus do We insert denial into the hearts of the criminals.

source: لا يؤمنون به وقد خلت سنة الأولين
en: They will not believe in it, while there has already occurred the precedent of the former peoples.

source: ولو فتحنا عليهم بابا من السماء فظلوا فيه يعرجون
en: And [even] if We opened to them a gate from the heaven and they continued therein to ascend,

source: لقالوا إنما سكرت أبصارنا بل نحن قوم مسحورون
en: They would say, "Our eyes have only been dazzled. Rather, we are a people affected by magic."

source: ولقد جعلنا في السماء بروجا وزيناها للناظرين
en: And We have placed within the heaven great stars and have beautified it for the observers.

source: وحفظناها من كل شيطان رجيم
en: And We have protected it from every devil expelled [from the mercy of Allah]

source: إلا من استرق السمع فأتبعه شهاب مبين
en: Except one who steals a hearing and is pursued by a clear burning flame.

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل شيء موزون
en: And the earth - We have spread it and cast therein firmly set mountains and caused to grow therein [something] of every well-balanced thing.

source: وجعلنا لكم فيها معايش ومن لستم له برازقين
en: And We have made for you therein means of living and [for] those for whom you are not providers.

source: وإن من شيء إلا عندنا خزائنه وما ننزله إلا بقدر معلوم
en: And there is not a thing but that with Us are its depositories, and We do not send it down except according to a known measure.

source: وأرسلنا الرياح لواقح فأنزلنا من السماء ماء فأسقيناكموه وما أنتم له بخازنين
en: And We have sent the fertilizing winds and sent down water from the sky and given you drink from it. And you are not its retainers.

source: وإنا لنحن نحيي ونميت ونحن الوارثون
en: And indeed, it is We who give life and cause death, and We are the Inheritor.

source: ولقد علمنا المستقدمين منكم ولقد علمنا المستأخرين
en: And We have already known the preceding [generations] among you, and We have already known the later [ones to come].

source: وإن ربك هو يحشرهم إنه حكيم عليم
en: And indeed, your Lord will gather them; indeed, He is Wise and Knowing.

source: ولقد خلقنا الإنسان من صلصال من حمإ مسنون
en: And We did certainly create man out of clay from an altered black mud.

source: والجان خلقناه من قبل من نار السموم
en: And the jinn We created before from scorching fire.

source: وإذ قال ربك للملائكة إني خالق بشرا من صلصال من حمإ مسنون
en: And [mention, O Muhammad], when your Lord said to the angels, "I will create a human being out of clay from an altered black mud.

source: فإذا سويته ونفخت فيه من روحي فقعوا له ساجدين
en: And when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration."

source: فسجد الملائكة كلهم أجمعون
en: So the angels prostrated - all of them entirely,

source: إلا إبليس أبى أن يكون مع الساجدين
en: Except Iblees, he refused to be with those who prostrated.

source: قال يا إبليس ما لك ألا تكون مع الساجدين
en: [Allah] said, O Iblees, what is [the matter] with you that you are not with those who prostrate?"

source: قال لم أكن لأسجد لبشر خلقته من صلصال من حمإ مسنون
en: He said, "Never would I prostrate to a human whom You created out of clay from an altered black mud."

source: قال فاخرج منها فإنك رجيم
en: [Allah] said, "Then get out of it, for indeed, you are expelled.

source: وإن عليك اللعنة إلى يوم الدين
en: And indeed, upon you is the curse until the Day of Recompense."

source: قال رب فأنظرني إلى يوم يبعثون
en: He said, "My Lord, then reprieve me until the Day they are resurrected."

source: قال فإنك من المنظرين
en: [Allah] said, "So indeed, you are of those reprieved

source: إلى يوم الوقت المعلوم
en: Until the Day of the time well-known."

source: قال رب بما أغويتني لأزينن لهم في الأرض ولأغوينهم أجمعين
en: [Iblees] said, "My Lord, because You have put me in error, I will surely make [disobedience] attractive to them on earth, and I will mislead them all

source: إلا عبادك منهم المخلصين
en: Except, among them, Your chosen servants."

source: قال هذا صراط علي مستقيم
en: [Allah] said, "This is a path [of return] to Me [that is] straight.

source: إن عبادي ليس لك عليهم سلطان إلا من اتبعك من الغاوين
en: Indeed, My servants - no authority will you have over them, except those who follow you of the deviators.

source: وإن جهنم لموعدهم أجمعين
en: And indeed, Hell is the promised place for them all.

source: لها سبعة أبواب لكل باب منهم جزء مقسوم
en: It has seven gates; for every gate is of them a portion designated."

source: إن المتقين في جنات وعيون
en: Indeed, the righteous will be within gardens and springs.

source: ادخلوها بسلام آمنين
en: [Having been told], "Enter it in peace, safe [and secure]."

source: ونزعنا ما في صدورهم من غل إخوانا على سرر متقابلين
en: And We will remove whatever is in their breasts of resentment, [so they will be] brothers, on thrones facing each other.

source: لا يمسهم فيها نصب وما هم منها بمخرجين
en: No fatigue will touch them therein, nor from it will they [ever] be removed.

source: نبئ عبادي أني أنا الغفور الرحيم
en: [O Muhammad], inform My servants that it is I who am the Forgiving, the Merciful.

source: وأن عذابي هو العذاب الأليم
en: And that it is My punishment which is the painful punishment.

source: ونبئهم عن ضيف إبراهيم
en: And inform them about the guests of Abraham,

source: إذ دخلوا عليه فقالوا سلاما قال إنا منكم وجلون
en: When they entered upon him and said, "Peace." [Abraham] said, "Indeed, we are fearful of you."

source: قالوا لا توجل إنا نبشرك بغلام عليم
en: [The angels] said, "Fear not. Indeed, we give you good tidings of a learned boy."

source: قال أبشرتموني على أن مسني الكبر فبم تبشرون
en: He said, "Have you given me good tidings although old age has come upon me? Then of what [wonder] do you inform?"

source: قالوا بشرناك بالحق فلا تكن من القانطين
en: They said, "We have given you good tidings in truth, so do not be of the despairing."

source: قال ومن يقنط من رحمة ربه إلا الضالون
en: He said, "And who despairs of the mercy of his Lord except for those astray?"

source: قال فما خطبكم أيها المرسلون
en: [Abraham] said, "Then what is your business [here], O messengers?"

source: قالوا إنا أرسلنا إلى قوم مجرمين
en: They said, "Indeed, we have been sent to a people of criminals,

source: إلا آل لوط إنا لمنجوهم أجمعين
en: Except the family of Lot; indeed, we will save them all

source: إلا امرأته قدرنا إنها لمن الغابرين
en: Except his wife." Allah decreed that she is of those who remain behind.

source: فلما جاء آل لوط المرسلون
en: And when the messengers came to the family of Lot,

source: قال إنكم قوم منكرون
en: He said, "Indeed, you are people unknown."

source: قالوا بل جئناك بما كانوا فيه يمترون
en: They said, "But we have come to you with that about which they were disputing,

source: وأتيناك بالحق وإنا لصادقون
en: And we have come to you with truth, and indeed, we are truthful.

source: فأسر بأهلك بقطع من الليل واتبع أدبارهم ولا يلتفت منكم أحد وامضوا حيث تؤمرون
en: So set out with your family during a portion of the night and follow behind them and let not anyone among you look back and continue on to where you are commanded."

source: وقضينا إليه ذلك الأمر أن دابر هؤلاء مقطوع مصبحين
en: And We conveyed to him [the decree] of that matter: that those [sinners] would be eliminated by early morning.

source: وجاء أهل المدينة يستبشرون
en: And the people of the city came rejoicing.

source: قال إن هؤلاء ضيفي فلا تفضحون
en: [Lot] said, "Indeed, these are my guests, so do not shame me.

source: واتقوا الله ولا تخزون
en: And fear Allah and do not disgrace me."

source: قالوا أولم ننهك عن العالمين
en: They said, "Have we not forbidden you from [protecting] people?"

source: قال هؤلاء بناتي إن كنتم فاعلين
en: [Lot] said, "These are my daughters - if you would be doers [of lawful marriage]."

source: لعمرك إنهم لفي سكرتهم يعمهون
en: By your life, [O Muhammad], indeed they were, in their intoxication, wandering blindly.

source: فأخذتهم الصيحة مشرقين
en: So the shriek seized them at sunrise.

source: فجعلنا عاليها سافلها وأمطرنا عليهم حجارة من سجيل
en: And We made the highest part [of the city] its lowest and rained upon them stones of hard clay.

source: إن في ذلك لآيات للمتوسمين
en: Indeed in that are signs for those who discern.

source: وإنها لبسبيل مقيم
en: And indeed, those cities are [situated] on an established road.

source: إن في ذلك لآية للمؤمنين
en: Indeed in that is a sign for the believers.

source: وإن كان أصحاب الأيكة لظالمين
en: And the companions of the thicket were [also] wrongdoers.

source: فانتقمنا منهم وإنهما لبإمام مبين
en: So We took retribution from them, and indeed, both [cities] are on a clear highway.

source: ولقد كذب أصحاب الحجر المرسلين
en: And certainly did the companions of Thamud deny the messengers.

source: وآتيناهم آياتنا فكانوا عنها معرضين
en: And We gave them Our signs, but from them they were turning away.

source: وكانوا ينحتون من الجبال بيوتا آمنين
en: And they used to carve from the mountains, houses, feeling secure.

source: فأخذتهم الصيحة مصبحين
en: But the shriek seized them at early morning.

source: فما أغنى عنهم ما كانوا يكسبون
en: So nothing availed them [from] what they used to earn.

source: وما خلقنا السماوات والأرض وما بينهما إلا بالحق وإن الساعة لآتية فاصفح الصفح الجميل
en: And We have not created the heavens and earth and that between them except in truth. And indeed, the Hour is coming; so forgive with gracious forgiveness.

source: إن ربك هو الخلاق العليم
en: Indeed, your Lord - He is the Knowing Creator.

source: ولقد آتيناك سبعا من المثاني والقرآن العظيم
en: And We have certainly given you, [O Muhammad], seven of the often repeated [verses] and the great Qur'an.

source: لا تمدن عينيك إلى ما متعنا به أزواجا منهم ولا تحزن عليهم واخفض جناحك للمؤمنين
en: Do not extend your eyes toward that by which We have given enjoyment to [certain] categories of the disbelievers, and do not grieve over them. And lower your wing to the believers

source: وقل إني أنا النذير المبين
en: And say, "Indeed, I am the clear warner" -

source: كما أنزلنا على المقتسمين
en: Just as We had revealed [scriptures] to the separators

source: الذين جعلوا القرآن عضين
en: Who have made the Qur'an into portions.

source: فوربك لنسألنهم أجمعين
en: So by your Lord, We will surely question them all

source: عما كانوا يعملون
en: About what they used to do.

source: فاصدع بما تؤمر وأعرض عن المشركين
en: Then declare what you are commanded and turn away from the polytheists.

source: إنا كفيناك المستهزئين
en: Indeed, We are sufficient for you against the mockers

source: الذين يجعلون مع الله إلها آخر فسوف يعلمون
en: Who make [equal] with Allah another deity. But they are going to know.

source: ولقد نعلم أنك يضيق صدرك بما يقولون
en: And We already know that your breast is constrained by what they say.

source: فسبح بحمد ربك وكن من الساجدين
en: So exalt [Allah] with praise of your Lord and be of those who prostrate [to Him].

source: واعبد ربك حتى يأتيك اليقين
en: And worship your Lord until there comes to you the certainty (death).

source: أتى أمر الله فلا تستعجلوه سبحانه وتعالى عما يشركون
en: The command of Allah is coming, so be not impatient for it. Exalted is He and high above what they associate with Him.

source: ينزل الملائكة بالروح من أمره على من يشاء من عباده أن أنذروا أنه لا إله إلا أنا فاتقون
en: He sends down the angels, with the inspiration of His command, upon whom He wills of His servants, [telling them], "Warn that there is no deity except Me; so fear Me."

source: خلق السماوات والأرض بالحق تعالى عما يشركون
en: He created the heavens and earth in truth. High is He above what they associate with Him.

source: خلق الإنسان من نطفة فإذا هو خصيم مبين
en: He created man from a sperm-drop; then at once, he is a clear adversary.

source: والأنعام خلقها لكم فيها دفء ومنافع ومنها تأكلون
en: And the grazing livestock He has created for you; in them is warmth and [numerous] benefits, and from them you eat.

source: ولكم فيها جمال حين تريحون وحين تسرحون
en: And for you in them is [the enjoyment of] beauty when you bring them in [for the evening] and when you send them out [to pasture].

source: وتحمل أثقالكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس إن ربكم لرءوف رحيم
en: And they carry your loads to a land you could not have reached except with difficulty to yourselves. Indeed, your Lord is Kind and Merciful.

source: والخيل والبغال والحمير لتركبوها وزينة ويخلق ما لا تعلمون
en: And [He created] the horses, mules and donkeys for you to ride and [as] adornment. And He creates that which you do not know.

source: وعلى الله قصد السبيل ومنها جائر ولو شاء لهداكم أجمعين
en: And upon Allah is the direction of the [right] way, and among the various paths are those deviating. And if He willed, He could have guided you all.

source: هو الذي أنزل من السماء ماء لكم منه شراب ومنه شجر فيه تسيمون
en: It is He who sends down rain from the sky; from it is drink and from it is foliage in which you pasture [animals].

source: ينبت لكم به الزرع والزيتون والنخيل والأعناب ومن كل الثمرات إن في ذلك لآية لقوم يتفكرون
en: He causes to grow for you thereby the crops, olives, palm trees, grapevines, and from all the fruits. Indeed in that is a sign for a people who give thought.

source: وسخر لكم الليل والنهار والشمس والقمر والنجوم مسخرات بأمره إن في ذلك لآيات لقوم يعقلون
en: And He has subjected for you the night and day and the sun and moon, and the stars are subjected by His command. Indeed in that are signs for a people who reason.

source: وما ذرأ لكم في الأرض مختلفا ألوانه إن في ذلك لآية لقوم يذكرون
en: And [He has subjected] whatever He multiplied for you on the earth of varying colors. Indeed in that is a sign for a people who remember.

source: وهو الذي سخر البحر لتأكلوا منه لحما طريا وتستخرجوا منه حلية تلبسونها وترى الفلك مواخر فيه ولتبتغوا من فضله ولعلكم تشكرون
en: And it is He who subjected the sea for you to eat from it tender meat and to extract from it ornaments which you wear. And you see the ships plowing through it, and [He subjected it] that you may seek of His bounty; and perhaps you will be grateful.

source: وألقى في الأرض رواسي أن تميد بكم وأنهارا وسبلا لعلكم تهتدون
en: And He has cast into the earth firmly set mountains, lest it shift with you, and [made] rivers and roads, that you may be guided,

source: وعلامات وبالنجم هم يهتدون
en: And landmarks. And by the stars they are [also] guided.

source: أفمن يخلق كمن لا يخلق أفلا تذكرون
en: Then is He who creates like one who does not create? So will you not be reminded?

source: وإن تعدوا نعمة الله لا تحصوها إن الله لغفور رحيم
en: And if you should count the favors of Allah, you could not enumerate them. Indeed, Allah is Forgiving and Merciful.

source: والله يعلم ما تسرون وما تعلنون
en: And Allah knows what you conceal and what you declare.

source: والذين يدعون من دون الله لا يخلقون شيئا وهم يخلقون
en: And those they invoke other than Allah create nothing, and they [themselves] are created.

source: أموات غير أحياء وما يشعرون أيان يبعثون
en: They are, [in fact], dead, not alive, and they do not perceive when they will be resurrected.

source: إلهكم إله واحد فالذين لا يؤمنون بالآخرة قلوبهم منكرة وهم مستكبرون
en: Your god is one God. But those who do not believe in the Hereafter - their hearts are disapproving, and they are arrogant.

source: لا جرم أن الله يعلم ما يسرون وما يعلنون إنه لا يحب المستكبرين
en: Assuredly, Allah knows what they conceal and what they declare. Indeed, He does not like the arrogant.

source: وإذا قيل لهم ماذا أنزل ربكم قالوا أساطير الأولين
en: And when it is said to them, "What has your Lord sent down?" They say, "Legends of the former peoples,"

source: ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم ألا ساء ما يزرون
en: That they may bear their own burdens in full on the Day of Resurrection and some of the burdens of those whom they misguide without knowledge. Unquestionably, evil is that which they bear.

source: قد مكر الذين من قبلهم فأتى الله بنيانهم من القواعد فخر عليهم السقف من فوقهم وأتاهم العذاب من حيث لا يشعرون
en: Those before them had already plotted, but Allah came at their building from the foundations, so the roof fell upon them from above them, and the punishment came to them from where they did not perceive.

source: ثم يوم القيامة يخزيهم ويقول أين شركائي الذين كنتم تشاقون فيهم قال الذين أوتوا العلم إن الخزي اليوم والسوء على الكافرين
en: Then on the Day of Resurrection He will disgrace them and say, "Where are My 'partners' for whom you used to oppose [the believers]?" Those who were given knowledge will say, "Indeed disgrace, this Day, and evil are upon the disbelievers" -

source: الذين تتوفاهم الملائكة ظالمي أنفسهم فألقوا السلم ما كنا نعمل من سوء بلى إن الله عليم بما كنتم تعملون
en: The ones whom the angels take in death [while] wronging themselves, and [who] then offer submission, [saying], "We were not doing any evil." But, yes! Indeed, Allah is Knowing of what you used to do.

source: فادخلوا أبواب جهنم خالدين فيها فلبئس مثوى المتكبرين
en: So enter the gates of Hell to abide eternally therein, and how wretched is the residence of the arrogant.

source: وقيل للذين اتقوا ماذا أنزل ربكم قالوا خيرا للذين أحسنوا في هذه الدنيا حسنة ولدار الآخرة خير ولنعم دار المتقين
en: And it will be said to those who feared Allah, "What did your Lord send down?" They will say, "[That which is] good." For those who do good in this world is good; and the home of the Hereafter is better. And how excellent is the home of the righteous -

source: جنات عدن يدخلونها تجري من تحتها الأنهار لهم فيها ما يشاءون كذلك يجزي الله المتقين
en: Gardens of perpetual residence, which they will enter, beneath which rivers flow. They will have therein whatever they wish. Thus does Allah reward the righteous -

source: الذين تتوفاهم الملائكة طيبين يقولون سلام عليكم ادخلوا الجنة بما كنتم تعملون
en: The ones whom the angels take in death, [being] good and pure; [the angels] will say, "Peace be upon you. Enter Paradise for what you used to do."

source: هل ينظرون إلا أن تأتيهم الملائكة أو يأتي أمر ربك كذلك فعل الذين من قبلهم وما ظلمهم الله ولكن كانوا أنفسهم يظلمون
en: Do the disbelievers await [anything] except that the angels should come to them or there comes the command of your Lord? Thus did those do before them. And Allah wronged them not, but they had been wronging themselves.

source: فأصابهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: So they were struck by the evil consequences of what they did and were enveloped by what they used to ridicule.

source: وقال الذين أشركوا لو شاء الله ما عبدنا من دونه من شيء نحن ولا آباؤنا ولا حرمنا من دونه من شيء كذلك فعل الذين من قبلهم فهل على الرسل إلا البلاغ المبين
en: And those who associate others with Allah say, "If Allah had willed, we would not have worshipped anything other than Him, neither we nor our fathers, nor would we have forbidden anything through other than Him." Thus did those do before them. So is there upon the messengers except [the duty of] clear notification?

source: ولقد بعثنا في كل أمة رسولا أن اعبدوا الله واجتنبوا الطاغوت فمنهم من هدى الله ومنهم من حقت عليه الضلالة فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين
en: And We certainly sent into every nation a messenger, [saying], "Worship Allah and avoid Taghut." And among them were those whom Allah guided, and among them were those upon whom error was [deservedly] decreed. So proceed through the earth and observe how was the end of the deniers.

source: إن تحرص على هداهم فإن الله لا يهدي من يضل وما لهم من ناصرين
en: [Even] if you should strive for their guidance, [O Muhammad], indeed, Allah does not guide those He sends astray, and they will have no helpers.

source: وأقسموا بالله جهد أيمانهم لا يبعث الله من يموت بلى وعدا عليه حقا ولكن أكثر الناس لا يعلمون
en: And they swear by Allah their strongest oaths [that] Allah will not resurrect one who dies. But yes - [it is] a true promise [binding] upon Him, but most of the people do not know.

source: ليبين لهم الذي يختلفون فيه وليعلم الذين كفروا أنهم كانوا كاذبين
en: [It is] so He will make clear to them [the truth of] that wherein they differ and so those who have disbelieved may know that they were liars.

source: إنما قولنا لشيء إذا أردناه أن نقول له كن فيكون
en: Indeed, Our word to a thing when We intend it is but that We say to it, "Be," and it is.

source: والذين هاجروا في الله من بعد ما ظلموا لنبوئنهم في الدنيا حسنة ولأجر الآخرة أكبر لو كانوا يعلمون
en: And those who emigrated for [the cause of] Allah after they had been wronged - We will surely settle them in this world in a good place; but the reward of the Hereafter is greater, if only they could know.

source: الذين صبروا وعلى ربهم يتوكلون
en: [They are] those who endured patiently and upon their Lord relied.

source: وما أرسلنا من قبلك إلا رجالا نوحي إليهم فاسألوا أهل الذكر إن كنتم لا تعلمون
en: And We sent not before you except men to whom We revealed [Our message]. So ask the people of the message if you do not know.

source: بالبينات والزبر وأنزلنا إليك الذكر لتبين للناس ما نزل إليهم ولعلهم يتفكرون
en: [We sent them] with clear proofs and written ordinances. And We revealed to you the message that you may make clear to the people what was sent down to them and that they might give thought.

source: أفأمن الذين مكروا السيئات أن يخسف الله بهم الأرض أو يأتيهم العذاب من حيث لا يشعرون
en: Then, do those who have planned evil deeds feel secure that Allah will not cause the earth to swallow them or that the punishment will not come upon them from where they do not perceive?

source: أو يأخذهم في تقلبهم فما هم بمعجزين
en: Or that He would not seize them during their [usual] activity, and they could not cause failure?

source: أو يأخذهم على تخوف فإن ربكم لرءوف رحيم
en: Or that He would not seize them gradually [in a state of dread]? But indeed, your Lord is Kind and Merciful.
